app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" = 'PG-13' LIMIT 1
SELECT "movies".* FROM "movies"
---
  def index
    @movies = []
    @rating_flag = {}
	@all_ratings = Movie.get_all_ratings
    if params.has_key?(:ratings)
      selected_ratings = params[:ratings]
      selected_ratings.each do |key, content|
        @rating_flag[key] = true
        @movies += Movie.find_all_by_rating(key)
      end
    else
      @all_ratings.each do |x|